Coding/Python/最近更新博文自动生成的Python脚本.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>最近更新博文自动生成的Python脚本</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="最近更新博文自动生成的Python脚本"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-23 04:35:38 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#python">主页</a><br/><a href="#disqus_thread">评论</a></div>

</head>
<body>


<div id="content">
<h1 class="title">最近更新博文自动生成的Python脚本</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>

<p>
每完一篇博文我都要在index.html相应的分类里面加上类似:<br/>
</p><blockquote>

<p>&lt;li&gt;&lt;a href="Coding/Python/最近更新博文自动生成的Python脚本.html"&gt;最近更新博文自动生成的Python脚本&lt;/a&gt;&lt;/li&gt;<br/>
</p>
</blockquote>


<p><br/>
这样的一句话，此时通过 <b>git blame index.html</b> 命令可以看到:<br/>
</p><blockquote>

<p>00000000 (Not Committed Yet 2012-10-23 04:13:10 +0800  96)                 &lt;li&gt;&lt;a href="Coding/Python/最近更新博文自动生成的Python脚本.html"&gt;最近更新博文自动生成的Python脚本&lt;/a&gt;&lt;/li&gt;<br/>
</p>
</blockquote>


<p><br/>
第一列表示提交标识，由于还没有提交，所以为0；第二列表示作者，由于还没有提示，显示的是(Not Committed；第三列显示日期；第四列显示行号；之后是此行内容。<br/>
可以写个Python脚本来自动生成最近更新的博文，用到的模块主要有：subprocess和re，前者用于执行shell命令，后者用于正则匹配。<br/>
</p>
<p><br/>
<pre class="src src-python"><span style="color: #b22222;">#!/usr/bin/python</span>
<span style="color: #a020f0;">from</span> subprocess <span style="color: #a020f0;">import</span> call
<span style="color: #a020f0;">import</span> re

call(<span style="color: #8b2252;">'cd ~/visayafan.github.com'</span>, shell=<span style="color: #a020f0;">True</span>)
call(<span style="color: #8b2252;">'git blame index.html &gt; shan.html'</span>, shell=<span style="color: #a020f0;">True</span>)
<span style="color: #a0522d;">content</span> = <span style="color: #7a378b;">open</span>(<span style="color: #8b2252;">'shan.html'</span>, <span style="color: #8b2252;">'r'</span>).read()
call(<span style="color: #8b2252;">'rm -rf shan.html'</span>, shell=<span style="color: #a020f0;">True</span>)
<span style="color: #a0522d;">dateAndLink</span> = re.compile(<span style="color: #8b2252;">'(\d{4}-\d{2}-\d{2}\s\d{2}:\d{2}:\d{2}).*\&lt;li\&gt;\&lt;a(\shref="(?=Linux|Coding|Algorithm|Compiler|Others|English).*\&gt;)(.+)(\&lt;/a\&gt;\&lt;/li\&gt;)'</span>)
<span style="color: #a0522d;">allCont</span> = dateAndLink.findall(content)
allCont.sort()
<span style="color: #b22222;"># for vdate, vlinkpre, vname, vlinkafter in allCont:</span>
<span style="color: #b22222;">#     print vdate, vlinkpre, vname, vlinkafter</span>
<span style="color: #a0522d;">htmlcont</span> = <span style="color: #7a378b;">open</span>(<span style="color: #8b2252;">'updates.html'</span>).read()
<span style="color: #a0522d;">ul</span> = re.compile(r<span style="color: #8b2252;">'&lt;ul&gt;'</span>)
<span style="color: #a020f0;">for</span> vdate, vlinkpre, vname, vlinkafter <span style="color: #a020f0;">in</span> allCont:
    <span style="color: #a020f0;">if</span> <span style="color: #a020f0;">not</span> re.findall(vlinkpre, htmlcont):
        htmlcont = ul.sub(<span style="color: #8b2252;">'&lt;ul&gt;\n      &lt;li&gt;'</span>+vdate+<span style="color: #8b2252;">'&amp;nbsp&lt;a target="_top" '</span>+vlinkpre+vname+vlinkafter, htmlcont)
<span style="color: #7a378b;">open</span>(<span style="color: #8b2252;">'updates.html'</span>, <span style="color: #8b2252;">'w'</span>).write(htmlcont)
</pre>


</p><ol>
<li>(\d{4}-\d{2}-\d{2}\s\d{2}:\d{2}:\d{2}) 用于匹配日期<br/>
</li>
<li>由于index.html是通过iframe来显示updates.html的，所以链接要加上target="_top"，不然点击链接的时候只能在iframe里打开而不是在整个页面打开。<br/>
</li>
<li>\&lt;li\&gt;\&lt;a(\shref="(?=Linux|Coding|Algorithm|Compiler|Others|English).*\&gt;)用来匹配&lt;li&gt;到文件名这段<br/>
</li>
<li>(.+)用来匹配文件名<br/>
</li>
<li>(\&lt;/a\&gt;\&lt;/li\&gt;)匹配&lt;/a&gt;&lt;/li&gt;<br/>
</li>
</ol>

<p>所有匹配结果保存在allCont中，通过list内置的sort函数排序（由于列表第一个是日期，所以默认是对日期排序，这也正是我们所需要的）。<br/>
之后查找每个匹配在updates.html中是否出现过，如果没有就插入，此处为实现插入效果用的是正则表达式的替换函数sub，即替换&lt;ul&gt;为&lt;ul&gt;\n&lt;li&gt;日期&lt;a href="链接"&gt;博文名&lt;/a&gt;&lt;/li&gt;.(由于updates.html只有一个&lt;ul&gt;标签，所以这么做没有问题)<br/>
</p>
<p><br/>
效果正如主页中的Home标签下"最近更新"所示。<br/>
</p></div>

</body>
</html>
